# Pandas

Useful links:
- [DOCUMENTATION HOME PAGE](https://pandas.pydata.org/pandas-docs/stable/)
- [API REFERENCE](https://pandas.pydata.org/pandas-docs/stable/reference/index.html)

IMPORTANT: this is **not** a comprehensive list.

## Functions

- **get_dummies** [doc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.get_dummies.html): Convert categorical variable into dummy/indicator variables
- **read_csv**: import a DataFrame from a .csv file
- **merge**: Merge DataFrame objects by performing a database-style join operation by columns or indexes.

## `DataFrame` class
[DOCUMENTATION](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html)

### Some useful methods
- **append**: Append rows to the end of the dataframe returning a new object.
- **apply**: Apply a function along an axis of the DataFrame.
- **copy**: Make a copy of this objectâ€™s indices and data.
- **count**: Count non-NA cells for each column or row.
- **describe**: Generate descriptive statistics about the dataframe, excluding NaN values.
- **drop**: Drop specified labels from rows or columns.
- **drop_duplicates**: Return DataFrame with duplicate rows removed, optionally only considering certain columns.
- **groupby**: Group DataFrame or Series using a mapper or by a Series of columns.
- **head**: Return the first n rows.
- **info**: Print a concise summary of a DataFrame.
- **max**: Return the maximum of the values for the requested axis.
- **mean**: Return the mean of the values for the requested axis.
- **median**: Return the median of the values for the requested axis.
- **merge**: Merge DataFrame or named Series objects with a database-style join.
- **min**: Return the minimum of the values for the requested axis.
- **rename**: Alter axes labels.
- **reset_index**: Reset the index, or a level of it.
- **sample**: Return a random sample of items from an axis of object.
- **sort_values**: Sort by the values along either axis.
- **tail**: Return the last n rows.
- **to_csv**: Write object to a comma-separated values (csv) file.


### Some useful attributes
- **columns**: The column labels of the DataFrame.
- **index**: The index (row labels) of the DataFrame.
- **shape**: Return a tuple representing the dimensionality of the DataFrame.
- **size**: Return an int representing the number of elements in this object.
- **values**: Return a Numpy representation of the DataFrame.

### Others...
- **selecting one or more columns**: can be done with square brackets and the name of the columns withing the brackets. In case several columns are accessed, double square brackets are needed.

## `Series` class
[DOCUMENTATION](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html#pandas.Series)

Series objects are "One-dimensional ndarray with axis labels" and, most of the times, you will be dealing with them as output of some operations performed on a DataFrame.
For instance, when you do `my_df['column_name']` the created object is a Series.

If you are wondering what's the difference between a one column DF and a Series object, you can find a good answer [here](https://stackoverflow.com/questions/26047209/what-is-the-difference-between-a-pandas-series-and-a-single-column-dataframe/): "*the Series is the data structure for a single column of a DataFrame*"

### Some useful methods
- **apply**: Invoke function on values of Series.
- **max**: Return the maximum of the values for the requested axis.
- **mean**: Return the mean of the values for the requested axis.
- **median**: Return the median of the values for the requested axis.
- **memory_usage**: Return the memory usage of the Series.
- **min**: Return the minimum of the values for the requested axis.
- **unique**: Return unique values of Series object.
- **value_counts**: Return a Series containing counts of unique values.

---

## Usage examples

IMPORTANT: this is **not** a comprehensive list.
It only showcases some of the possible usages of the concepts listed above.

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'column_a':[0,1,2,2,3,4], 'column_b':['a','b','c','d','e','f']})
display(df)

   column_a column_b
0         0        a
1         1        b
2         2        c
3         2        d
4         3        e
5         4        f

#### append

In [3]:
new_df = pd.DataFrame({'column_a':[10, 20], 'column_b':['z','y']})
display(df.append(new_df))

   column_a column_b
0         0        a
1         1        b
2         2        c
3         2        d
4         3        e
5         4        f
0        10        z
1        20        y

#### apply

Applies a function along the specified axis. It can be used for creating new columns or modify existing ones.
The following example creates a new column named `column_c` by doubling the elements in `column_a`.
The part within parenthesis (`lambda row: row['column_a']*2, axis=1`) is called *lambda function* and performs the specified operation for each row.

In [4]:
df['column_c'] = df.apply(lambda row: row['column_a']*2, axis=1)
display(df)

   column_a column_b  column_c
0         0        a         0
1         1        b         2
2         2        c         4
3         2        d         4
4         3        e         6
5         4        f         8

another example, modifying the already existing `column_c`: it becames the concatenation of elements in column_a and the elements in column_b

In [5]:
df['column_c'] = df.apply(lambda row: str(row['column_a'])+row['column_b'], axis=1)
display(df)

   column_a column_b column_c
0         0        a       0a
1         1        b       1b
2         2        c       2c
3         2        d       2d
4         3        e       3e
5         4        f       4f

#### copy

In [6]:
new_df = df.copy()
display(new_df)

   column_a column_b column_c
0         0        a       0a
1         1        b       1b
2         2        c       2c
3         2        d       2d
4         3        e       3e
5         4        f       4f

#### count

In [7]:
new_df = pd.DataFrame({'column_a':[0,1,None,4], 'column_b':['a','b','c','d']})
display(new_df)

   column_a column_b
0       0.0        a
1       1.0        b
2       NaN        c
3       4.0        d

In [8]:
new_df.count()

column_a    3
column_b    4
dtype: int64

#### describe

In [9]:
display(df)

   column_a column_b column_c
0         0        a       0a
1         1        b       1b
2         2        c       2c
3         2        d       2d
4         3        e       3e
5         4        f       4f

In [10]:
df.describe()

       column_a
count  6.000000
mean   2.000000
std    1.414214
min    0.000000
25%    1.250000
50%    2.000000
75%    2.750000
max    4.000000

#### drop

In [11]:
display(df)

   column_a column_b column_c
0         0        a       0a
1         1        b       1b
2         2        c       2c
3         2        d       2d
4         3        e       3e
5         4        f       4f

In [12]:
df.drop('column_c', axis=1)

   column_a column_b
0         0        a
1         1        b
2         2        c
3         2        d
4         3        e
5         4        f

#### drop_duplicates

In [13]:
display(df)

   column_a column_b column_c
0         0        a       0a
1         1        b       1b
2         2        c       2c
3         2        d       2d
4         3        e       3e
5         4        f       4f

In [14]:
df.drop_duplicates('column_a')

   column_a column_b column_c
0         0        a       0a
1         1        b       1b
2         2        c       2c
4         3        e       3e
5         4        f       4f

#### groupby

In [15]:
display(df)

   column_a column_b column_c
0         0        a       0a
1         1        b       1b
2         2        c       2c
3         2        d       2d
4         3        e       3e
5         4        f       4f

In [16]:
df.groupby('column_a')

The groupby is never used on its own.
It is always used together with something else.
For instance, if I want to count the number of occurrences of each value of `column_a`:

In [17]:
df.groupby('column_a').size().reset_index()

   column_a  0
0         0  1
1         1  1
2         2  2
3         3  1
4         4  1

#### head

In [18]:
df.head(2)

   column_a column_b column_c
0         0        a       0a
1         1        b       1b

#### info

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
column_a    6 non-null int64
column_b    6 non-null object
column_c    6 non-null object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

#### max

In [20]:
df.max()

column_a     4
column_b     f
column_c    4f
dtype: object

In [21]:
df['column_a'].max()

4

#### mean

In [22]:
df['column_a'].mean()

2.0

#### median

In [23]:
df['column_a'].median()

2.0

#### min

In [24]:
df.min()

column_a     0
column_b     a
column_c    0a
dtype: object

#### rename

In [25]:
display(df)

   column_a column_b column_c
0         0        a       0a
1         1        b       1b
2         2        c       2c
3         2        d       2d
4         3        e       3e
5         4        f       4f

In [26]:
df.rename(columns={'column_c': 'new_name'})

   column_a column_b new_name
0         0        a       0a
1         1        b       1b
2         2        c       2c
3         2        d       2d
4         3        e       3e
5         4        f       4f

#### reset_index

You will mostly use it together with the groupby.

In [27]:
df.groupby('column_a').size()

column_a
0    1
1    1
2    2
3    1
4    1
dtype: int64

In [28]:
df.groupby('column_a').size().reset_index()

   column_a  0
0         0  1
1         1  1
2         2  2
3         3  1
4         4  1

#### sample

In [29]:
df.sample(3)

   column_a column_b column_c
0         0        a       0a
1         1        b       1b
4         3        e       3e

#### sort_values

In [30]:
df.sort_values('column_a', ascending=False)

   column_a column_b column_c
5         4        f       4f
4         3        e       3e
2         2        c       2c
3         2        d       2d
1         1        b       1b
0         0        a       0a

#### tail

In [31]:
df.tail(3)

   column_a column_b column_c
3         2        d       2d
4         3        e       3e
5         4        f       4f

#### to_csv

In [32]:
# df.to_csv('temporary_file.csv')

#### columns

In [33]:
df.columns

Index(['column_a', 'column_b', 'column_c'], dtype='object')

#### index

In [34]:
df.index

RangeIndex(start=0, stop=6, step=1)

#### shape

In [35]:
df.shape

(6, 3)

#### size

In [36]:
df.size

18

#### values

In [37]:
df.values

array([[0, 'a', '0a'],
       [1, 'b', '1b'],
       [2, 'c', '2c'],
       [2, 'd', '2d'],
       [3, 'e', '3e'],
       [4, 'f', '4f']], dtype=object)

In [38]:
df['column_a'].values

array([0, 1, 2, 2, 3, 4])

---

#### get_dummies

In [43]:
df = pd.DataFrame({'column_a':[0,1,2,2,3], 'column_b':['a','b','a','a','b']})
print("Before performing pd.get_dummies:")
display(df)
print("After performing pd.get_dummies:")
display(pd.get_dummies(df, 'column_b'))

Before performing pd.get_dummies:

   column_a column_b
0         0        a
1         1        b
2         2        a
3         2        a
4         3        b

After performing pd.get_dummies:

   column_a  column_b_a  column_b_b
0         0           1           0
1         1           0           1
2         2           1           0
3         2           1           0
4         3           0           1

---